{"basics":{"name":"Mritunjoy Halder","label":"Researcher","image":"assets/img/mritunjoy_profile.jpg","email":"mritunjoyhalder79@gmail.com","phone":"+918583879907","url":"https://www.mritunjoyh.github.io","summary":"A dedicated Computer Vision Researcher, looking for new opportunities to work in Generative models, 3D/4D Vision","location":{"address":"Kolkata","postalCode":"KOL 700150","city":"Kolkata","countryCode":"India","region":"West Bengal"},"profiles":[{"network":"LinkedIN","username":"Mritunjoy Halder","url":"https://www.linkedin.com/in/mritunjoy-halder-36b427204/"}]},"work":[{"name":"TCS Reserach (formerly Tata Research, Developement and Design Centre)","position":"Researcher","url":"https://www.tcs.com/what-we-do/research","startDate":"2025-07-03","endDate":"Present","summary":"I am working as a researcher in the Visual Computing and Embodied Intelligence Lab, where my work primarily focuses on creating synthetic world environments using generative models that visualize imagined scenes and objects that do not exist.","highlights":["Computer Vision, Computer Graphics, Image Processing, Deep Learning"]}],"volunteer":[{"organization":"IEEE International Joint Conference on Neural Networks","location":"Pan International","position":"Reviewer (TPC)","url":"https://2025.ijcnn.org/","startDate":"2024-01-31","endDate":"Present","summary":"I reviewed various papers for this conference and provided feedback on whether they should be accepted or not."}],"education":[{"institution":"Indian Institute of Engineering Science and Technology Shibpur","location":"Howrah","url":"https://www.iiests.ac.in/","area":"Information Technology","studyType":"Bachelor's of Technology","startDate":"2019-08-01","endDate":"2023-03-31","score":"9.1","courses":["Computer Science"]},{"institution":"Jadavpur Vidyapith","location":"Kolkata","url":"https://www.jadavpurvidyapith.in/","area":"Puer Science","studyType":"Senior Secondary","startDate":"2017-01-01","endDate":"2019-03-31","score":"90.2%","courses":["Physics, Chemistry, Mathematics, Computer Science"]},{"institution":"Jadavpur Vidyapith","location":"Kolkata","url":"https://www.jadavpurvidyapith.in/","area":"General","studyType":"Secondary","startDate":"2011-01-01","endDate":"2016-12-31","score":"88.28%","courses":["General"]}],"publications":[{"name":"A transmission model based deep neural network for image dehazing","publisher":"Multimedia Tools and Applications","releaseDate":"2024","url":"https://doi.org/10.1007/s11042-023-17010-4"},{"name":"Anomalous activity detection for mobile surveillance robots","publisher":"US Patent App. 18/473,595","releaseDate":"May 2024","url":"https://patents.google.com/patent/US20240177488A1/en"},{"name":"Anomalous activity detection from ego view camera of surveillance robots","publisher":"IEEE International Joint Conference on Neural Networks","releaseDate":"2023","url":"https://doi.org/10.1109/IJCNN54540.2023.10191611"},{"name":"Multi-feature based hazy image classification for vision enhancement","publisher":"Procedia Computer Science","releaseDate":"2023","url":"https://doi.org/10.1016/j.procs.2023.01.238"},{"name":"A deep learning model to detect foggy images for vision enhancement","publisher":"The Imaging Science Journal","releaseDate":"2023","url":"https://doi.org/10.1080/13682199.2023.2185429"},{"name":"Dehazing and vision enhancement: challenges and future scope","publisher":"IET Intelligent Multimedia Processing and Computer Vision","releaseDate":"2023","url":"https://doi.org/10.1049/PBPC064E_ch10"},{"name":"A Framework for Sex Identification, Accent and Emotion Recognition from Speech Samples","publisher":"13th International Conference on Computing Communication and Networking Technologies","releaseDate":"2022","url":"https://doi.org/10.1109/ICCCNT54827.2022.9984265"}],"projects":[{"name":"Improved Diagnosis on Low Resolution Medical Images","summary":"Medical images are important because they are used in a more sensitive field, namely the medical field. Raw data obtained directly from medical acquisition devices may provide a relatively poor representation of image quality. The primary goal of this project is to improve the features and characteristics of medical images in order to make improved diagnoses. Also it is extremely difficult to transfer high resolution images (e.g., MRI, CT) over low bandwidth. So the captured medical image is converted to low resolution format(how we converted) and then transmitted to the other end. During transmission, data can suffer loss due to various types of noises. Degraded low resolution image received in the receiver side need to be reconstructed. Image Enhancement (IE) algorithms are introduced for carrying out the requirements of converting received low resolution medical images to high resolution. We proposed a dual GAN architecture in our work to convert sensitive low resolution images to high resolution images that can be processed in the medical field. The model is composed of two GANs where the first GAN enhances the entire image and the second GAN enhances the region of interest in the image. The second discriminator has a novel loss function which focus particularly on the region of interest in modeical images. The work was able to surpass many of the SOTA scores by obtaining a Structural Similarity of 0.84.","highlights":"B.Tech Final Year Project"},{"name":"Cartoon Emotion Recognition","summary":"Social media platforms are widely used by individuals and organizations to express emotions, opinions, and ideas. These platforms generate vast amounts of data, which can be analyzed to gain insights into user behavior, preferences, and sentiment. Accurately classifying the sentiment of social media posts can provide valuable insights for businesses, individuals, and organizations to make informed decisions. To accomplish this task, a customized private cartoon dataset (original images) of social media posts has been provided, which contains labels for each post's emotion category, such as happy, angry, sad, or neutral. The task is to build and fine-tune a machine-learning model that accurately classifies social media posts into their corresponding emotion categories, using synthetic images. Where we obtained an accuracy of 95% on competition dataset.","highlights":"Hackathon Revelation 2023"}],"skills":[{"name":"Computer Vision","level":"Advanced","icon":"fa-solid fa-hashtag"},{"name":"Computer Graphics","level":"Intermediate","icon":"fa-solid fa-hashtag"},{"name":"Deep Learning","level":"Advanced","icon":"fa-solid fa-hashtag"},{"name":"Image Processing","level":"Advanced","icon":"fa-solid fa-hashtag"},{"name":"Machine Learning","level":"Advanced","icon":"fa-solid fa-hashtag"}],"languages":[{"language":"C/C++","fluency":"Intermediate","icon":""},{"language":"Python","fluency":"Advanced","icon":""}],"tools":[{"tools":"Blender (bpy)","fluency":"Intermediate","icon":""},{"tools":"MATLAB","fluency":"Intermediate","icon":""}]}